{"creation":{
    "userStory":{
    "title":"Crea tu historia de usuario",
    "description":"Las historias de usuario son unas pocas frases en lenguaje sencillo que describen  el resultado deseado. No entran en detalles, ya que los requisitos se añaden más tarde, una vez acordados por el equipo. Las historias encajan perfectamente en marcos ágiles como scrum y kanban.",
    "ID-HU":"ID HU",
    "Name-HU":"Nombre HU",
    "Dificulty-HU":"Dificultad HU",
    "No-Epic":"N° Epica",
    "describe":"Descripción de historia de usuario:",
    "save":"Guardar HU"
    },
    "project":{
    "button-send":"Enviar",
    "name":"Nombre del proyecto"
    }
    
    
},
"form":{
    "register":{
        "title":"Registro",
        "name-placeholder":"Nombre",
        "last-placeholder":"Apellido",
        "email-placeholder":"Correo",
        "password-placeholder":"Contraseña",
        "have-account":"¿Ya tiene una cuenta?"
    },
    "login":{
        "title":"Ingresar",
        "email-placeholder":"Correo",
        "password-placeholder":"Contraseña",        
        "Create-account":"Crear una cuenta"
    }
},
"nav-bar":{
    "Home":"Inicio",
    "Log In":"Ingresar",
    "Log Out" :"Cerrar Sesión",
    "Sign Up":"Registro",    
    "english":"Inglés",
    "español":"Español",
    "cargando":"Cargando..."

},
"home":{
    "title":"Metodologías Ágiles",
    "m1":"Las metodologías ágiles son un conjunto de enfoques y prácticas que se utilizan en el desarrollo de software y otros proyectos complejos para mejorar la capacidad de adaptación y la eficacia del equipo. Estas metodologías se centran en la entrega de valor al cliente a través de un enfoque iterativo e incremental.",
    "m2":"En lugar de seguir un plan rígido desde el principio hasta el final, las metodologías ágiles se basan en la iteración y la colaboración continua entre el equipo y el cliente. Esto significa que el equipo trabaja en ciclos cortos y regulares, entregando una versión funcional del producto o proyecto después de cada iteración.",
    "m3":"Entre las metodologías ágiles más populares se encuentran Scrum, Kanban, XP (Extreme Programming), Lean, entre otras. Estas metodologías comparten muchos principios y valores similares, como la transparencia, la colaboración, el enfoque en el valor del cliente y la adaptabilidad al cambio.",
    "m4":" Las metodologías ágiles parten del ",
    "m5": "Manifiesto por el Desarrollo Ágil de Software",
    "m6":" donde se establecen los valores y principios fundamentales de este tipo de metodología de desarrollo.",
    "title3":"Manifiesto por el Desarrollo Ágil de Software",
    "t1":"El Manifiesto Ágil para el Desarrollo de Software es un documento creado en el año 2001 por un grupo de expertos en desarrollo de software que buscaban una forma más efectiva de abordar proyectos complejos. El Manifiesto describe los valores (como los que se observan a continuación) y principios fundamentales de las metodologías ágiles y se ha convertido en una guía para el desarrollo de software y otros proyectos en diversos campos.",
    "t2":"Individuos e interacciones",
    "t3":"Sobre procesos y herramientas",
    "t4":"Software funcionando",
    "t5":"Sobre documentación extensiva",
    "t6":"Colaboración con el cliente",
    "t7":"Sobre negociación contractual",
    "t8":"Respuesta ante el cambio",
    "t9":"Sobre seguir un plan",
    "title4":"  Valores del Manifiesto",
    "title5":"  Principios del Manifiesto",
    "p":"Los principios del Manifiesto Ágil para el Desarrollo de Software son un conjunto directrices que se derivan de los cuatro valores fundamentales del manifiesto y que se utilizan como guía para el desarrollo ágil de software. Estos principios son los siguientes:",
    "p1":"Nuestra principal prioridad es satisfacer al cliente a través de la entrega temprana y continua de software con valor.",
    "p2":"Aceptamos que los requisitos cambian y el software debe adaptarse en consecuencia.",
    "p3":"Entregamos software funcional de forma frecuente, con una frecuencia que va de unas pocas semanas a unos pocos meses, con preferencia por el período más corto posible.",
    "p4":"Los responsables del negocio y los desarrolladores trabajan juntos diariamente a lo largo del proyecto.",
    "p5":"Construimos proyectos en torno a individuos motivados. Les damos el entorno y el apoyo que necesitan y confiamos en que harán el trabajo.",
    "p6":"El método más eficiente y efectivo de comunicar información al equipo de desarrollo y entre sus miembros es a través de conversaciones cara a cara.",
    "p7":"El software funcionando es la medida principal del progreso.",
    "p8":"Los procesos ágiles promueven el desarrollo sostenible. Los patrocinadores, desarrolladores y usuarios deben ser capaces de mantener un ritmo constante de forma indefinida.",
    "p9":"La atención continua a la excelencia técnica y el buen diseño mejora la agilidad.",
    "p10":"La simplicidad, o el arte de maximizar la cantidad de trabajo no realizado, es esencial.",
    "p11":"Las mejores arquitecturas, requisitos y diseños surgen de equipos autoorganizados.",
    "p12":"A intervalos regulares, el equipo reflexiona sobre cómo convertirse en más efectivo, luego ajusta y perfecciona su comportamiento en consecuencia.",
    "p13":"Estos principios se utilizan como una guía para la gestión de proyectos y el desarrollo de software en entornos ágiles, y se aplican en conjunto con los valores fundamentales establecidos en el Manifiesto Ágil.",
    "title2":"Metodología Tradicional vs. Medología Ágil",
    "c1":"Características",
    "c2":"Metodologías Ágiles",
    "c3":"Métodología Tradicional",
    "c4":"Planificación",
    "c5":"Se planifica el proyecto en ciclos cortos, llamados sprints, y se revisan y actualizan los planes a medida que avanza el proyecto.",
    "c6":"Se planifica todo el proyecto de principio a fin antes de comenzar a trabajar en él.",
    "c7":"Flexibilidad",
    "c8":"Es más flexible y puede adaptarse a los cambios en los requisitos del proyecto, incluso si los cambios ocurren en medio del ciclo de vida del proyecto.",
    "c9":"Es menos flexible y se centra en seguir el plan original.",
    "c10":"Comunicación",
    "c11":"La comunicación es más informal y frecuente, y se enfoca en la colaboración entre los miembros del equipo y con el cliente.",
    "c12":"Se centra en la documentación detallada y en la comunicación formal entre los miembros del equipo.",
    "c13":"Entrega de Valor",
    "c14":"Las pruebas se realizan durante todo el ciclo de vida del proyecto para asegurarse de que el software entregado sea de alta calidad.",
    "c15":"Las pruebas se realizan al final del ciclo de vida del proyecto.",
    "c16":"Control del Proyecto",
    "c17":"Se enfoca en el control del proyecto a través de la retroalimentación frecuente y la adaptación continua.",
    "c18":"Se enfoca en el control del proyecto a través de planes y presupuestos detallados."
}
}

