{"creation":{
    "userStory":{
        "title":"Create your user story",
        "description":"The user stories are a little phrase in simple language that describe the desired result. No go into details, as the results are added later, once agreed upon by the team. The stories fit perfectly in agile frameworks like scrum and kanban.",
        "ID-HU":"ID US",
        "Name-HU":"Name US",
        "Dificulty-HU":"Difficulty US",
        "No-Epic":"No. Epic",
        "describe":"User stories' description",
        "save":"Save US"
    },
    "project":{
        "button-send":"Send",
        "name":"Project's name"
    }    
    
},
"form":{
    "register":{
        "title":"Sign Up",
        "name-placeholder":"Name",
        "last-placeholder":"Lastname",
        "email-placeholder":"Email",
        "password-placeholder":"Password",
        "button":"Sign Up",
        "have-account":"Already have an account?"
    },
    "login":{
        "title":"Log In",
        "email-placeholder":"Email",
        "password-placeholder":"Password",        
        "Create-account":"Create an account"
    }
},
"nav-bar":{
    "Home":"Home",
    "Log In":"Log In",
    "Sign Up":"Sign Up",    
    "english":"English",
    "español":"Spanish",
    "cargando":"Loading..."

},
"home":{
    "title":"Agile Methodologies",
    "m1":"Agile methodologies are a set of approaches and practices used in software development and other complex projects to improve team adaptability and effectiveness. These methodologies focus on delivering value to the customer through an iterative and incremental approach.",
    "m2":"Instead of following a rigid plan from start to finish, agile methodologies are based on continuous iteration and collaboration between the team and the customer. This means the team works in short, regular cycles, delivering a functional version of the product or project after each iteration.",
    "m3":"Popular agile methodologies include Scrum, Kanban, XP (Extreme Programming), Lean, and others. These methodologies share many similar principles and values, such as transparency, collaboration, customer value focus, and adaptability to change.",
    "m4":" Agile methodologies are based on ",
    "m5": "Agile Software Development Manifesto",
    "m6":" where the fundamental values and principles of this type of development methodology are established.",
    "title3":"Agile Software Development Manifesto",
    "t1":"The Agile Manifesto for Software Development is a document created in 2001 by a group of software development experts seeking a more effective way to approach complex projects. The Manifesto describes the values (such as those noted below) and fundamental principles of agile methodologies and has become a guide for software development and other projects in a variety of fields.",
    "t2":"Individuals and interactions",
    "t3":"About processes and tools",
    "t4":"Software in operation",
    "t5":"About extensive documentation",
    "t6":"Collaboration with the customer",
    "t7":"On contract negotiation",
    "t8":"Response to change",
    "t9":"About following a plan",
    "title4":"  Manifesto Values",
    "title5":"  Principles of the Manifesto",
    "p":"The principles of the Agile Manifesto for Software Development are a set of guidelines that are derived from the four core values of the manifesto and are used as a guide for agile software development. These principles are as follows:",
    "p1":"Our main priority is customer satisfaction through early and continuous delivery of valuable software.",
    "p2":"We accept that requirements change and the software must adapt accordingly.",
    "p3":"We deliver functional software on a frequent basis, with a frequency ranging from a few weeks to a few months, preferably for the shortest possible period.",
    "p4":"Business managers and developers work together on a daily basis throughout the project.",
    "p5":"We build projects around motivated individuals. We give them the environment and support they need and trust them to get the job done.",
    "p6":"The most efficient and effective method of communicating information to the development team and among its members is through face-to-face conversations.",
    "p7":"Working software is the primary measure of progress.",
    "p8":"Agile processes promote sustainable development. Sponsors, developers and users must be able to maintain a constant pace indefinitely.",
    "p9":"Continuous attention to technical excellence and good design improves agility.",
    "p10":"Simplicity, or the art of maximizing the amount of work not done, is essential.",
    "p11":"The best architectures, requirements and designs emerge from self-organized teams.",
    "p12":"At regular intervals, the team reflects on how to become more effective, then adjusts and refines its behavior accordingly.",
    "p13":"These principles are used as a guide for project management and software development in agile environments, and are applied in conjunction with the core values set out in the Agile Manifesto.",
    "title2":"Traditional Methodology vs. Agile Methodology",
    "c1":"Features",
    "c2":"Agile Methodology",
    "c3":"Traditional Methodology",
    "c4":"Planning",
    "c5":"The project is planned in short cycles, called sprints, and plans are reviewed and updated as the project progresses.",
    "c6":"The entire project is planned from start to finish before work begins.",
    "c7":"Flexibility",
    "c8":"It is more flexible and can adapt to changes in project requirements, even if the changes occur in the middle of the project life cycle.",
    "c9":"It is less flexible and focuses on following the original plan.",
    "c10":"Communication",
    "c11":"Communication is more informal and frequent, and focuses on collaboration among team members and with the customer.",
    "c12":"It focuses on detailed documentation and formal communication between team members.",
    "c13":"Value Delivery",
    "c14":"Testing is performed throughout the project lifecycle to ensure that the delivered software is of high quality.",
    "c15":"Testing is performed at the end of the project life cycle.",
    "c16":"Project Control",
    "c17":"It focuses on project control through frequent feedback and continuous adaptation.",
    "c18":"It focuses on project control through detailed plans and budgets."
}
}
